The file output.txt might have duplicated data in case the Main function its ran twice, since I was deleting the db manually if needed
But I created it each time I ran the file

## Test queries
```bash
MATCH (c:Customer) RETURN COUNT(c) AS customerCount
MATCH (o:Order) RETURN COUNT(o) AS orderCount
MATCH (p:Product) RETURN COUNT(p) AS productCount
MATCH (s:Sales) RETURN COUNT(s) AS salesCount
```
```bash
MATCH (c:Customer)-[:ORDERED]->(o:Order) 
MATCH (o:Order)-[:CONTAINS]->(p:Product) 
MATCH (o:Order)-[:SOLD_FOR]->(s:Sales) 
RETURN COUNT(c) AS customerOrders, COUNT(o) AS orders, COUNT(p) AS products, COUNT(s) AS sales
```


### 1. Number of customers per region
**Command:**
```bash
MATCH (c:Customer)
RETURN c.region AS region, COUNT(c) AS customerCount
ORDER BY customerCount DESC;
```
**Result:**
```bash
╒══════════╤═════════════╕
│region    │customerCount│
╞══════════╪═════════════╡
│"Pacific" │1689         │
├──────────┼─────────────┤
│"Atlantic"│1535         │
├──────────┼─────────────┤
│"Interior"│1222         │
├──────────┼─────────────┤
│"Gulf"    │861          │
└──────────┴─────────────┘
```
### 2. Most bought product per city and it's quantity
**Command:**
```bash
MATCH (c:Customer)-[:ORDERED]->(o:Order)-[:CONTAINS]->(p:Product)
WITH c.city AS city, p.id AS productId, COUNT(p) AS productCount
WITH city, productId, productCount
ORDER BY city, productCount DESC
WITH city, COLLECT({productId: productId, productCount: productCount}) AS products
RETURN city, products[0].productId AS mostBoughtProductId, products[0].productCount AS mostBoughtProductCount;
```
**Result:**
```bash
╒═══════════════════╤═══════════════════╤══════════════════════╕
│city               │mostBoughtProductId│mostBoughtProductCount│
╞═══════════════════╪═══════════════════╪══════════════════════╡
│"Aberdeen"         │"CHO-SCR-58000"    │1                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Abilene"          │"CHO-MIL-31000"    │1                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Akron"            │"CHO-TRI-54000"    │5                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Albuquerque"      │"CHO-MIL-31000"    │6                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Alexandria"       │"CHO-MIL-31000"    │5                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Allen"            │"CHO-TRI-54000"    │2                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Allentown"        │"CHO-TRI-54000"    │3                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Altoona"          │"CHO-MIL-31000"    │2                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Amarillo"         │"CHO-FUD-51000"    │4                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Anaheim"          │"CHO-SCR-58000"    │7                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Andover"          │"CHO-SCR-58000"    │2                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Ann Arbor"        │"CHO-MIL-31000"    │2                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Antioch"          │"CHO-NUT-13000"    │1                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Apopka"           │"CHO-NUT-13000"    │2                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Apple Valley"     │"CHO-TRI-54000"    │3                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Appleton"         │"CHO-TRI-54000"    │1                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Arlington"        │"CHO-TRI-54000"    │14                    │
├───────────────────┼───────────────────┼──────────────────────┤
│"Arlington Heights"│"CHO-NUT-13000"    │1                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Arvada"           │"CHO-SCR-58000"    │2                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Asheville"        │"CHO-SCR-58000"    │3                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Athens"           │"CHO-SCR-58000"    │3                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Atlanta"          │"CHO-TRI-54000"    │9                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Atlantic City"    │"CHO-SCR-58000"    │1                     │
├───────────────────┼───────────────────┼──────────────────────┤
│"Auburn"           │"CHO-TRI-54000"    │6                     │
```
 - The result was far too big so I cut it

### 3. Customer with the most amount of orders
**Command:**
```bash
MATCH (c:Customer)-[:ORDERED]->(o:Order)
WITH c.id AS customerId, COUNT(o) AS orderCount
ORDER BY orderCount DESC
LIMIT 1
RETURN customerId, orderCount;
```
**Result:**
```bash
╒══════════╤══════════╕
│customerId│orderCount│
╞══════════╪══════════╡
│"129322"  │15        │
└──────────┴──────────┘
```
### 4. Most units sold per product
**Command:**
```bash
MATCH (o:Order)-[:CONTAINS]->(p:Product)
RETURN p.name AS product, SUM(toInteger(p.units)) AS totalUnitsSold
ORDER BY totalUnitsSold DESC
```
**Result:**
```bash
╒═══════════════════════════════════╤══════════════╕
│product                            │totalUnitsSold│
╞═══════════════════════════════════╪══════════════╡
│"Wonka Bar - Milk Chocolate"       │8079          │
├───────────────────────────────────┼──────────────┤
│"Wonka Bar -Scrumdiddlyumptious"   │7508          │
├───────────────────────────────────┼──────────────┤
│"Wonka Bar - Triple Dazzle Caramel"│7373          │
├───────────────────────────────────┼──────────────┤
│"Wonka Bar - Fudge Mallows"        │6767          │
├───────────────────────────────────┼──────────────┤
│"Wonka Bar - Nutty Crunch Surprise"│6561          │
├───────────────────────────────────┼──────────────┤
│"Wonka Gum"                        │478           │
├───────────────────────────────────┼──────────────┤
│"Lickable Wallpaper"               │393           │
├───────────────────────────────────┼──────────────┤
│"Kazookles"                        │371           │
├───────────────────────────────────┼──────────────┤
│"SweeTARTS"                        │41            │
├───────────────────────────────────┼──────────────┤
│"Laffy Taffy"                      │27            │
├───────────────────────────────────┼──────────────┤
│"Fizzy Lifting Drinks"             │21            │
├───────────────────────────────────┼──────────────┤
│"Hair Toffee"                      │17            │
├───────────────────────────────────┼──────────────┤
│"Everlasting Gobstopper"           │13            │
├───────────────────────────────────┼──────────────┤
│"Nerds"                            │10            │
├───────────────────────────────────┼──────────────┤
│"Fun Dip"                          │8             │
└───────────────────────────────────┴──────────────┘
```
### 5. Total sales per year
**Command:**
```bash
MATCH (o:Order)-[:SOLD_FOR]->(s:Sales)
WITH SUBSTRING(o.orderDate, 0, 4) AS year, SUM(toFloat(s.sales)) AS totalSales
RETURN year, totalSales
ORDER BY year ASC;
```
**Result:**
```bash
╒══════╤══════════════════╕
│year  │totalSales        │
╞══════╪══════════════════╡
│"2021"│28366.879999999735│
├──────┼──────────────────┤
│"2022"│28210.01999999978 │
├──────┼──────────────────┤
│"2023"│35876.00999999982 │
├──────┼──────────────────┤
│"2024"│45831.20999999986 │
└──────┴──────────────────┘
```
### 6. Customer that bought the most amount of products
**Command:**
```bash
MATCH (c:Customer)-[:ORDERED]->(o:Order)-[:CONTAINS]->(p:Product)
WITH c.id AS customerId, SUM(toInteger(p.units)) AS totalProducts
ORDER BY totalProducts DESC
LIMIT 1
RETURN customerId, totalProducts;
```
**Result:**
```bash
╒══════════╤═════════════╕
│customerId│totalProducts│
╞══════════╪═════════════╡
│"115238"  │110          │
└──────────┴─────────────┘
```
### 7. Revenue per customer
**Command:**
```bash
MATCH (c:Customer)-[:ORDERED]->(o:Order)-[:SOLD_FOR]->(s:Sales)
RETURN c.id AS customerId, SUM(toFloat(s.sales)) AS totalRevenue
ORDER BY totalRevenue DESC;
```
**Result:**
```bash
╒══════════╤══════════════════╕
│customerId│totalRevenue      │
╞══════════╪══════════════════╡
│"131807"  │454.4             │
├──────────┼──────────────────┤
│"115238"  │380.5             │
├──────────┼──────────────────┤
│"122336"  │352.2             │
├──────────┼──────────────────┤
│"164756"  │304.14            │
├──────────┼──────────────────┤
│"124163"  │247.35            │
├──────────┼──────────────────┤
│"164770"  │232.4             │
├──────────┼──────────────────┤
│"125388"  │216.0             │
├──────────┼──────────────────┤
│"163790"  │208.95            │
├──────────┼──────────────────┤
│"164147"  │204.65            │
├──────────┼──────────────────┤
│"140326"  │202.05            │
├──────────┼──────────────────┤
│"139675"  │202.0             │
├──────────┼──────────────────┤
│"107202"  │200.0             │
├──────────┼──────────────────┤
│"163328"  │197.61            │
├──────────┼──────────────────┤
│"165344"  │189.0             │
├──────────┼──────────────────┤
│"151799"  │184.6             │
├──────────┼──────────────────┤
│"129322"  │180.75            │
├──────────┼──────────────────┤
│"147900"  │180.0             │
├──────────┼──────────────────┤
│"119508"  │177.14000000000001│
├──────────┼──────────────────┤
│"138247"  │175.6             │
├──────────┼──────────────────┤
│"106376"  │173.0             │
├──────────┼──────────────────┤
│"117457"  │167.94            │
├──────────┼──────────────────┤
```
- Incomplete, too big of a result
### 8. Orders by ship mode
**Command:**
```bash
MATCH (o:Order)
RETURN o.shipMode AS shipMode, COUNT(o) AS orderCount
ORDER BY orderCount DESC;
```
**Result:**
```bash
╒════════════════╤══════════╕
│shipMode        │orderCount│
╞════════════════╪══════════╡
│"Standard Class"│5142      │
├────────────────┼──────────┤
│"Second Class"  │1653      │
├────────────────┼──────────┤
│"First Class"   │1312      │
├────────────────┼──────────┤
│"Same Day"      │442       │
└────────────────┴──────────┘
```
### 9. Number of orders in between two dates
**Command:**
```bash
MATCH (o:Order)
WHERE date(o.orderDate) >= date("2023-01-01") AND date(o.orderDate) <= date("2023-12-31")
RETURN COUNT(o) AS orderCount;
```
**Result:**
```bash
╒══════════╕
│orderCount│
╞══════════╡
│2223      │
└──────────┘
```
### 10. Month with the most amount of sales per year
**Command:**
```bash
MATCH (o:Order)-[:SOLD_FOR]->(s:Sales)
WITH SUBSTRING(o.orderDate, 0, 4) AS year, SUBSTRING(o.orderDate, 5, 2) AS month, SUM(toFloat(s.sales)) AS totalSales
WITH year, month, totalSales
ORDER BY year, totalSales DESC
WITH year, COLLECT({month: month, totalSales: totalSales}) AS monthlySales
RETURN year, monthlySales[0].month AS topMonth, monthlySales[0].totalSales AS highestSales;
```
**Result:**
```bash
╒══════╤════════╤══════════════════╕
│year  │topMonth│highestSales      │
╞══════╪════════╪══════════════════╡
│"2021"│"11"    │4293.4299999999985│
├──────┼────────┼──────────────────┤
│"2022"│"11"    │4454.219999999998 │
├──────┼────────┼──────────────────┤
│"2023"│"12"    │5517.240000000006 │
├──────┼────────┼──────────────────┤
│"2024"│"11"    │6629.96000000001  │
└──────┴────────┴──────────────────┘
```
